#+title: Day11
#+PROPERTY: header-args

* Work Sharing Constructs
**  Sections
* Synchronization
** omp reduction
*** Code
#+begin_src C :tangle reduction.c :results output
#include<stdio.h>
#define N 100
int main(){
  int a[N];
  long long sum = 0;
  for(int i = 0; i < N; i++) a[i] = i + 1;
  #pragma omp parallel for reduction(+:sum)
  for(int i = 0; i < N; i++){
    sum+= a[i];
  }

  printf("Sum = %lld\n", sum);
  printf("ActualSum = %d\n", (N * (N + 1)) / 2);
}
#+end_src
*** Compile and run
#+begin_src bash
bash run.sh -f reduction.c -c -t 8
#+end_src

#+RESULTS:
| -------------------------------------------------------- |   |      |
| Sum                                                      | = | 5050 |
| ActualSum                                                | = | 5050 |
